src/Catalogs/ПериодыРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ПериодыРаботы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоСмены</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеСмены</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ПериодыРаботы/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

// Процедура, обработчик события "ПередЗаписью"
//
Процедура ПередЗаписью(Отказ)         	
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	
	ПериодРаботы = ОбщегоНазначенияСтоматология.ПолучитьНаибольшееВремяРаботы(СтруктурнаяЕдиница);
	
	Если Дата(1,1,1) = ОкончаниеСмены Тогда 	     
		ОкончаниеСмены = ОкончаниеСмены + 23*60*60 + 59*60;
	КонецЕсли;
	
	Если НачалоСмены > ОкончаниеСмены и не НачалоДня(ОкончаниеСмены) = ОкончаниеСмены Тогда
		Отказ = Истина;
		ТекстСообщения = НСтр("ru = 'Время начала рабочей смены, больше времени окончания рабочей смены!'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);		
	КонецЕсли;
	
	Если (НачалоСмены = ОкончаниеСмены) и (не НачалоДня(НачалоСмены) = НачалоСмены и не НачалоДня(ОкончаниеСмены) = ОкончаниеСмены) Тогда
		Отказ = Истина;
		ТекстСообщения = НСтр("ru = 'Не задана продолжительность рабочей смены!'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	ВремяНачалоСмены = Дата(01,01,01) + (НачалоСмены - НачалоДня(НачалоСмены));
	ВремяОкончанияСмены =  Дата(01,01,01) + (ОкончаниеСмены - НачалоДня(ОкончаниеСмены));
	
	Если не ЗначениеЗаполнено(ПериодРаботы.НачалоРаботы) и не ЗначениеЗаполнено(ПериодРаботы.ОкончаниеРаботы) Тогда
		Отказ = Истина;
		ТекстСообщения = (НСтр("ru = 'Для данной структурной единицы не установлено время работы.'"));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	Иначе
		Если ВремяНачалоСмены < ПериодРаботы.НачалоРаботы Тогда
			Отказ = Истина;
			ТекстСообщения = НСтр("ru = 'Время начала рабочей смены, меньше времени начала рабочего дня!'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		Если  ВремяОкончанияСмены > ПериодРаботы.ОкончаниеРаботы Тогда
			Отказ = Истина;
			ТекстСообщения = НСтр("ru = 'Время окончания рабочей смены, больше времени окончания рабочего дня!'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	КонецЕсли;
	
	Если ПроверитьНаличиеАналогичногоПериода() И НЕ ЭтотОбъект.ПометкаУдаления Тогда
		Отказ = Истина;
		ТекстСообщения = НСтр("ru = 'Данный период работы по структурной единице """+ Строка(СтруктурнаяЕдиница) +""" уже существует.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

// Процедура, обрабочтик события "ПриКопировании"
//
Процедура ПриКопировании(ОбъектКопирования)
	
	 Заглушка = Истина; // Заглушка, чтобы не было пустого обработчика :)
	 
	 //Наименование       = "";
	 //НачалоСмены        = Неопределено;
	 //ОкончаниеСмены     = неопределено;
	 //СтруктурнаяЕдиница = Неопределено;
	
КонецПроцедуры

// Процедура, обработчик события "ОбработкаЗаполнения"
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") и ДанныеЗаполнения.Свойство("СтруктурнаяЕдиница") Тогда
		СтруктурнаяЕдиница   = ДанныеЗаполнения.СтруктурнаяЕдиница;
	Иначе
		СтруктурнаяЕдиница	 = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница; 		
	КонецЕсли;
	Наименование = Формат(НачалоСмены,"ДФ=ЧЧ:мм; ДП=00:00") + " - " + Формат(ОкончаниеСмены,"ДФ=ЧЧ:мм; ДП=23:59");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция проверяет наличие аналогичных периодов.
//
Функция ПроверитьНаличиеАналогичногоПериода()
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	ПериодыРаботы.Ссылка
	                      |ИЗ
	                      |	Справочник.ПериодыРаботы КАК ПериодыРаботы
	                      |ГДЕ
	                      |	ПериодыРаботы.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	                      |	И ПериодыРаботы.НачалоСмены = &НачалоСмены
	                      |	И ПериодыРаботы.ОкончаниеСмены = &ОкончаниеСмены
	                      |	И ПериодыРаботы.Ссылка <> &Ссылка");
						  
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("НачалоСмены", НачалоСмены);
	Запрос.УстановитьПараметр("ОкончаниеСмены", ОкончаниеСмены);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Возврат Результат.Следующий();
	
КонецФункции

#КонецОбласти
